In [2]:
import numpy as np
import pandas as pd

Q1.

In [4]:
data = pd.read_excel('hrdatabase2.xlsx',sheet_name='Region')

In [5]:
data

   REGION_ID               REGION_NAME
0                 1                  Europe
1                 2                Americas
2                 3                    Asia
3                 4  Middle East and Africa

Q2.

In [6]:
location = pd.read_excel('hrdatabase2.xlsx', sheet_name='locations')

In [13]:
location.columns

Index(['LOCATION_ID ', 'TREET_ADDRESS                           ',
       'POSTAL_CODE ', 'CITY                ', 'STATE_PROVINCE    ',
       'COUNTRY_ID'],
      dtype='object')

In [15]:
location['LOCATION_ID ']

0     1000
1     1100
2     1200
3     1300
4     1400
5     1500
6     1600
7     1700
8     1800
9     1900
10    2000
11    2100
12    2200
13    2300
14    2400
15    2500
16    2600
17    2700
18    2800
19    2900
20    3000
21    3100
22    3200
Name: LOCATION_ID , dtype: int64

Q3.

In [18]:
emp = pd.read_excel('hrdatabase2.xlsx',sheet_name = 'employee', nrows = 7)

In [19]:
emp

,EMPLOYEE ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,EPARTMENT_ID
0,100,Steven,King,SKING,515.123.4567,2003-06-17,AD_PRES,24000,0,0,90
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,2005-09-21,AD_VP,17000,0,100,90
2,102,Lex,De Haan,LDEHAAN,515.123.4569,2001-01-13,AD_VP,17000,0,100,90
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,2006-01-03,IT_PROG,9000,0,102,60
4,104,Bruce,Ernst,BERNST,590.423.4568,2007-05-21,IT_PROG,6000,0,103,60
5,105,David,Austin,DAUSTIN,590.423.4569,2005-06-25,IT_PROG,4800,0,103,60
6,106,Valli,Pataballa,VPATABAL,590.423.4560,2006-02-05,IT_PROG,4800,0,103,60

In [20]:
emp.columns

Index(['EMPLOYEE ID', 'FIRST_NAME', 'LAST_NAME', 'EMAIL', 'PHONE_NUMBER    ',
       'HIRE_DATE  ', 'JOB_ID     ', 'SALARY   ', 'COMMISSION_PCT ',
       'MANAGER_ID ', 'EPARTMENT_ID '],
      dtype='object')

Q4.

In [21]:
emp['EPARTMENT_ID '].unique()

array([90, 60], dtype=int64)

Q21.

In [3]:
job_his = pd.read_excel('hrdatabase.xlsx', sheet_name = 'job history')

In [4]:
job_his

   EMPLOYEE_ID START_DATE   END_DATE      JOB_ID  DEPARTMENT_ID
0          102 2001-01-13 2006-07-24     IT_PROG             60
1          101 1997-09-21 2001-10-27  AC_ACCOUNT            110
2          101 2001-10-28 2005-03-15      AC_MGR            110
3          201 2004-02-17 2007-12-19      MK_REP             20
4          114 2006-03-24 2007-12-31    ST_CLERK             50
5          122 2007-01-01 2007-12-31    ST_CLERK             50
6          200 1995-09-17 2001-06-17     AD_ASST             90
7          176 2006-03-24 2006-12-31      SA_REP             80
8          176 2007-01-01 2007-12-31      SA_MAN             80
9          200 2002-07-01 2006-12-31  AC_ACCOUNT             90

In [59]:
job_his['EMPLOYEE_ID'].size()

TypeError: 'int' object is not callable

In [49]:
new

EMPLOYEE_ID
101     True
102    False
114    False
122    False
176     True
200     True
201    False
dtype: bool

In [47]:
new

                 0
EMPLOYEE_ID
101           True
102          False
114          False
122          False
176           True
200           True
201          False

In [34]:
new

                 0
EMPLOYEE_ID
101           True
102          False
114          False
122          False
176           True
200           True
201          False